Revit 2024 API
PanelScheduleView.SwitchPhases Method
 Switches the circuit phases at the slot.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public void SwitchPhases(
	int nRow,
	int nCol
)
Visual Basic
Public Sub SwitchPhases ( _
	nRow As Integer, _
	nCol As Integer _
)
Visual C++
public:
void SwitchPhases(
	int nRow,
	int nCol
)
Parameters
nRow
Type: System.Int32
 Row Number.
nCol
Type: System.Int32
 Column Number.
Remarks
 Only one or two poles circuit on switchboard panel schedule can switch phases.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The circuit at given cell (nRow, nCol) is not one or two poles circuit.
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  The given row number nRow is invalid in Body. -or- The given column number nCol is invalid in Body. -or- There is no circuit at given cell (nRow, nCol).
Autodesk.Revit.Exceptions.InvalidOperationException |  This is not a switchboard panel schedule.
See Also
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace